Tekla Open API Reference for Tekla Structures 2025
MarkSymbolShape Enumeration
 The mark symbol shapes for the detail mark.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum MarkSymbolShape
Public Enumeration MarkSymbolShape
Members
Member name | Value | Description
None | 1 |  No shape.
Circular | 2 |  The circular shape.
SlashedCircular | 3 |  The slashed circular shape.
Custom | 4 |  The custom shape.
See Also
Reference
Tekla.Structures.Drawing Namespace